Examinator/src/Catalogs/РазделыФорумаСУО/РазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыФорумаСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Модератор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/РазделыФорумаСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ЭтоНовый() Тогда
		
		ДатаСоздания = ТекущаяДата();
		
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;

	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	ОбновитьПодчиненныеДокументы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы()
	
	Если НЕ УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|ГДЕ
		|	СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
		|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
		|	И СообщениеСУО.Проведен = ИСТИНА
		|	И СообщениеСУО.Тема.Контекст = &РазделФорума";

	Запрос.УстановитьПараметр("РазделФорума", Ссылка);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписиДокумента.Проведение,,3);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
